In [1]:
import pandas as pd

In [3]:
data=pd.read_csv(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\foodhub_order.csv")
data

,order_id,customer id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24
...,...,...,...,...,...,...,...,...,...
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19
1895,1477819,35309,Blue Ribbon Sushi,Japanese,25.22,Weekday,Not given,31,24
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31
1897,1478056,120353,Blue Ribbon Sushi,Japanese,19.45,Weekend,Not given,28,24

In [4]:
data.columns

Index(['order_id', 'customer id', 'restaurant_name', 'cuisine_type',
       'cost_of_the_order', 'day_of_the_week', 'rating',
       'food_preparation_time', 'delivery_time'],
      dtype='object')

In [5]:
data.order_id

0       1477147
1       1477685
2       1477070
3       1477334
4       1478249
         ...
1893    1476701
1894    1477421
1895    1477819
1896    1477513
1897    1478056
Name: order_id, Length: 1898, dtype: int64

In [6]:
data.customer id # this is not possible using .

SyntaxError: invalid syntax (4151100193.py, line 1)

In [7]:
# using []
data['customer id']

0       337525
1       358141
2        66393
3       106968
4        76942
         ...
1893    292602
1894    397537
1895     35309
1896     64151
1897    120353
Name: customer id, Length: 1898, dtype: int64

In [8]:
# accessing multiple columns 
data[['order_id','customer id','rating']]

      order_id  customer id     rating
0      1477147       337525  Not given
1      1477685       358141  Not given
2      1477070        66393          5
3      1477334       106968          3
4      1478249        76942          4
...        ...          ...        ...
1893   1476701       292602          5
1894   1477421       397537          5
1895   1477819        35309  Not given
1896   1477513        64151          5
1897   1478056       120353  Not given

[1898 rows x 3 columns]

In [9]:
data

,order_id,customer id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24
...,...,...,...,...,...,...,...,...,...
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19
1895,1477819,35309,Blue Ribbon Sushi,Japanese,25.22,Weekday,Not given,31,24
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31
1897,1478056,120353,Blue Ribbon Sushi,Japanese,19.45,Weekend,Not given,28,24

In [12]:
# add new column
data['order_completion_time']=data['food_preparation_time']+data['delivery_time']

In [13]:
data

,order_id,customer id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,order_completion_time
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20,45
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23,48
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28,51
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15,40
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24,49
...,...,...,...,...,...,...,...,...,...,...
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17,48
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19,50
1895,1477819,35309,Blue Ribbon Sushi,Japanese,25.22,Weekday,Not given,31,24,55
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31,54
1897,1478056,120353,Blue Ribbon Sushi,Japanese,19.45,Weekend,Not given,28,24,52

In [14]:
data['order status']='complete'
data

,order_id,customer id,restaurant_name,cuisine_type,cost_of_the_order,day_of_the_week,rating,food_preparation_time,delivery_time,order_completion_time,order status
0,1477147,337525,Hangawi,Korean,30.75,Weekend,Not given,25,20,45,complete
1,1477685,358141,Blue Ribbon Sushi Izakaya,Japanese,12.08,Weekend,Not given,25,23,48,complete
2,1477070,66393,Cafe Habana,Mexican,12.23,Weekday,5,23,28,51,complete
3,1477334,106968,Blue Ribbon Fried Chicken,American,29.20,Weekend,3,25,15,40,complete
4,1478249,76942,Dirty Bird to Go,American,11.59,Weekday,4,25,24,49,complete
...,...,...,...,...,...,...,...,...,...,...,...
1893,1476701,292602,Chipotle Mexican Grill $1.99 Delivery,Mexican,22.31,Weekend,5,31,17,48,complete
1894,1477421,397537,The Smile,American,12.18,Weekend,5,31,19,50,complete
1895,1477819,35309,Blue Ribbon Sushi,Japanese,25.22,Weekday,Not given,31,24,55,complete
1896,1477513,64151,Jack's Wife Freda,Mediterranean,12.18,Weekday,5,23,31,54,complete
1897,1478056,120353,Blue Ribbon Sushi,Japanese,19.45,Weekend,Not given,28,24,52,complete

In [15]:
dt=pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\inputData.xlsx")
dt

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [16]:
dt.size

390

In [17]:
dt['First Name']=='Aarav'

0      True
1     False
2     False
3     False
4     False
      ...
60    False
61    False
62    False
63    False
64    False
Name: First Name, Length: 65, dtype: bool

In [18]:
dt[dt['First Name']=='Aarav']

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
10      Aarav     Patil       85       78         90           92

In [26]:
# Filter data : Students secured greater than 80 marks in Physics
dt[dt['Physics']>80]

   First Name    Last Name  English  Physics  Chemistry  Mathematics
1      Vihaan     Deshmukh       88       81         85           89
3       Arjun         More       76       89         91           78
5      Vivaan         Nair       87       83         79           90
6      Aditya        Pawar       92       88         76           91
7       Rohan  Suryavanshi       78       82         90           86
8       Krish      Bhosale       80       85         83           89
11     Vihaan     Deshmukh       88       81         85           89
13      Arjun         More       76       89         91           78
15     Vivaan         Nair       87       83         79           90
16     Aditya        Pawar       92       88         76           91
17      Rohan  Suryavanshi       78       82         90           86
18      Krish      Bhosale       80       85         83           89
20       Riya     Kulkarni       91       84         78           87
21      Anaya      Gawande       84       90         82           88
24      Tejas     Waghmare       85       82         90           85
26      Kunal   Kshirsagar       81       81         85           88
28      Disha       Chavan       86       83         80           89
30      Aditi       Rajput       90       88         82           87
33      Aarvi     Bhandari       90       81         85           91
34     Raghav     Khedekar       79       86         82           90
35      Sneha      Gokhale       88       84         90           86
37      Tarun       Dhumal       82       87         81           85
38      Arnav      Khedkar       85       90         78           89
40      Rahul        Kadam       81       83         84           90
41       Jaya       Bhagat       92       88         76           89
42      Misha    Choudhary       78       85         90           86
43       Riya     Kulkarni       91       84         78           87
44      Anaya      Gawande       84       90         82           88
47      Tejas     Waghmare       85       82         90           85
49      Kunal   Kshirsagar       81       81         85           88
51      Disha       Chavan       86       83         80           89
53      Aditi       Rajput       90       88         82           87
56      Aarvi     Bhandari       90       81         85           91
57     Raghav     Khedekar       79       86         82           90
58      Sneha      Gokhale       88       84         90           86
60      Tarun       Dhumal       82       87         81           85
61      Arnav      Khedkar       85       90         78           89
63      Rahul        Kadam       81       83         84           90

In [27]:
# Filter data : Students name is "Samarth"
dt[dt['First Name']=='Samarth']

   First Name Last Name  English  Physics  Chemistry  Mathematics
9     Samarth    Shinde       89       79         87           88
19    Samarth    Shinde       89       79         87           88

In [29]:
# Filter records whoes First name is Arjun and Tarun using operator
dt[(dt['First Name']=='Arjun') | (dt['First Name']=='Tarun')]

   First Name Last Name  English  Physics  Chemistry  Mathematics
3       Arjun      More       76       89         91           78
13      Arjun      More       76       89         91           78
37      Tarun    Dhumal       82       87         81           85
60      Tarun    Dhumal       82       87         81           85

In [30]:
# Filter records whoes First name is Arjun and Tarun using isin
dt[dt['First Name'].isin(['Arjun','Tarun'])]

   First Name Last Name  English  Physics  Chemistry  Mathematics
3       Arjun      More       76       89         91           78
13      Arjun      More       76       89         91           78
37      Tarun    Dhumal       82       87         81           85
60      Tarun    Dhumal       82       87         81           85

In [31]:
# First name except Arjun and Tarun
dt[~dt['First Name'].isin(['Arjun','Tarun'])]

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
4     Reyansh     Joshi       82       80         84           85
5      Vivaan      Nair       87       83         79           90
..        ...       ...      ...      ...        ...          ...
59      Pooja    Mhatre       84       79         88           92
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[61 rows x 6 columns]

In [25]:
# Copy
# 1) Shallow Copy:Just creates a reference; changes in copy will affect original df.
#     df_copy = df.copy(deep=False)
# 2) Deep Copy: Creates an independent copy, so changes in copy won’t affect original df.
#     df_copy = df.copy(deep=True) 
#     df_copy = df.copy()   #by default = True

In [32]:
dt2=dt

In [33]:
dt2

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [34]:
dt3=dt.copy(deep=False)
dt3

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [36]:
dt3=dt.copy()
dt3

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [37]:
dt3.head(3)

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84